Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/third_level_education/fees_and_supports_for_third_level_education/postgraduate_student_grant.html.txt.tmx
Source language: en
Languages: ga

source: Students enrolling in postgraduate courses may get financial assistance under the Student Grant Scheme
ga: Ó bhliain acadúil 2012-2013 ar aghaidh, is ann d’athruithe ar an Scéim seo le haghaidh mic léinn iarchéime

source: Postgraduates may get financial assistance under the Student Grant Scheme with the cost of tuition fees for approved postgraduate courses in Ireland and Northern Ireland
ga: Féadfaidh iarchéimithe cúnamh airgeadais a fháil faoin Scéim Deontais do Mhic Léinn chun íoc as costas táillí teagaisc le haghaidh cúrsaí faofa iarchéime in Éirinn agus i dTuaisceart Éireann

source: There is no assistance under the Scheme for courses elsewhere in the EU
ga: Ní ann d’aon chúnamh faoin Scéim le haghaidh cúrsaí áiteanna eile san AE

source: There are 2 ways postgraduates may qualify for assistance under the Student Grant Scheme
ga: Is ann do 2 bhealach is féidir le hiarchéimithe cáiliú le haghaidh cúnaimh faoin Scéim Deontais do Mhic Léinn

source: 1.Get a new flat rate fee contribution of €2,000, if they pass the fee contribution means test – see below
ga: 1.Ranníocaíocht táille bhunráta nua €2,000 a fháil, má éiríonn leo sa tástáil um ranníocaíocht táille – féach thíos

source: 2.Get all their tuition fees paid and essential field trips (up to €6,270), if they meet the qualifying conditions for the special rate of grant for disadvantaged students – see below No maintenance grant is paid to new postgraduate students since 2012
ga: 2.A dtáillí teagaisc uile bheith íoctha (a mhéid agus €6,270), má shásaíonn siad na coinníollacha le haghaidh an ráta speisialta deontais le haghaidh mic léinn faoi mhíbhuntáiste – féach thíos

source: To qualify for assistance under the Student Grant Scheme you must also meet the criteria for nationality and immigration status, and residency
ga: Chun cáiliú don chúnamh faoin Scéim Deontais do Mhic Léinn, ní mór duit na critéir le haghaidh stádas náisiúntachta agus inimirce, agus cónaitheachta a shásamh, chomh maith

source: More information about these criteria can be found in our document on Grants for student in further and higher education
ga: Féadfaidh tú teacht ar bhreis faisnéise faoi na critéir seo inár gcáipéis ar Scéim um Dheontais do Mhic Léinn

source: Fee contribution means test
ga: Tástáil mhaoine um ranníocaíocht táille

source: The means test may be carried out on your income or your parent’s income
ga: Féadfar tabhairt faoin tástáil mhaoine ar d’ioncam nó ar ioncam do thuismitheoirí

source: It will depend on whether you are an independent mature student or dependent on your parents
ga: Braithfidh sé ar cibé acu an mac léinn neamhspleách lánfhásta thú nó an bhfuil tú spleách ar do thuismitheoirí

source: If you were ordinarily resident with your parents from October 1 of the year before the year of entry to higher education on an approved course, you are considered dependent on your parents. In this case, your income (if any) is assessed together with your parents' income(s)
ga: Má bhí gnáthchónaí ort le do thuismitheoirí ón 1 Deireadh Fómhair sa bhliain inar iontráil tú an cúrsa iarchéime, meastar go bhfuil tú spleách ar do thuismitheoirí agus déantar measúnú ar d'ioncam (más ann dó) mar aon le hionca(i)m do thuismitheoirí

source: An allowance is made for a certain amount of your earnings outside of term-time (up to €4,500)
ga: Ceadaítear duit suim áirithe a thuilleamh lasmuigh den téarma acadúil (a mhéid agus €4,500)

source: Independent students are mature students aged over 23 who live separately from their parents from 1 October of the year before the year of entry to higher education on an approved course
ga: Mic léinn lánfhásta iad mic léinn neamhspleácha atá breis agus 23 bliain d’aois a chónaíonn in áit lasmuigh de theach a dtuismitheoirí ón 1 Deireadh Fómhair sa bhliain inar iontráil siad an cúrsa

source: If you were classified as a dependent student you cannot be reclassified as an independent student unless there is a 3-year break in your studies
ga: Más mac léinn neamhspleách tú, déantar measúnú ort ar d’ioncam féin (agus é sin atá ag do chéile, páirtnéir sibhialta nó do chomháititheoir, más infheidhme)

source: The means test for the fee contribution under the Student Grant Scheme in 2017-2018 is based on your family's reckonable income for the previous full tax year (2016)
ga: Bunaítear an tástáil mhaoine don ranníocaíocht táille faoin Scéim Deontais do Mhic Léinn in 2017-2018 ar ioncam inríofa do theaghlaigh don bhliain iomlán chánach roimhe sin (2016)

source: If your family’s reckonable income is over the limit set by the Department of Education and Skills you will not qualify for the fee contribution
ga: Má sháraíonn ioncam inríofa do theaghlaigh an teorainn a shocraíonn an Roinn Oideachais agus Scileanna, ní cháileofar thú don ranníocaíocht táille

source: Some social welfare payments are excluded from 'reckonable income' for the purposes of the means test - see more details on reckonable income on susi.ie and also in the Student Grant Scheme 2017
ga: Ní chuirtear roinnt íocaíochtaí leasa shóisialaigh ó ‘ioncam inríofa’ ar mhaithe leis an tástáil mhaoine - féach tuilleadh sonraí ar ioncam inríofa ar susi.ie agus freisin i Scéim Deontais do Mhic Léinn 2017

source: If you or your family has had a change of circumstances after 31 December 2016, which has reduced your income permanently, your new reckonable income may be taken into account
ga: Má bhí athrú cúinsí ag do theaghlach i ndiaidh an 31 Nollaig 2016, a laghdaigh d’ioncam go buan, féadfar d’ioncam inríofa a chur san áireamh

source: If you are eligible for full assistance with the tuition fee from any other source, including sponsorship or an award, you will not qualify for the postgraduate fee contribution
ga: Má tá tú incháilithe do lánchúnamh leis an táille theagaisc ó aon fhoinse eile, lena n-áirítear urraíocht nó dámhachtain, ní cháileoidh tú don ranníocaíocht táille iarchéime

source: If you are eligible for partial assistance, your postgraduate fee contribution will be reduced by the amount of assistance you receive
ga: Má tá tú incháilithe do chúnamh páirteach, laghdófar do ranníocaíocht táille iarchéime faoin méid cúnaimh a fhaigheann tú

source: Income limits for the fee contribution
ga: Teorainneacha ioncaim don ranníocaíocht táille

source: The family income limits for eligibility for a postgraduate fee contribution in 2017-2018 are set out in the table below
ga: Leagtar amach na teorainneacha ioncam teaghlaigh amach le haghaidh teidlíocht ranníocaíocht táille iarchéime in 2017-2018 sa tábla thíos

source: │Number of dependent children │Reckonable income limits │
ga: │Líon na leanaí cleithiúnaigh │Teorainneacha ioncaim inríofa │

source: │Fewer than 4 │€31,500 │
ga: │Níos lú 4 │€31,500 │

source: │8 or more │€37,580 │
ga: │8 nó níos mó │€37,580 │

source: The reckonable income limits may be increased by €4,980 for each additional family member who is pursuing a full-time course of at least one year’s duration
ga: Féadfar na teorainneacha ioncaim a mhéadú faoi €4,980 le haghaidh gach duine muinteartha breise atá ag leanúint le cúrsa lánaimseartha a mhaireann bliain amháin ar a laghad

source: If you are an independent student, the family member taken into account is your spouse, civil partner or cohabitant
ga: Más mac léinn cleithiúnaigh thú, is é an duine muinteartha a chuirtear san áireamh do chéile, páirtnéir sibhialta nó do chomháititheoir

source: If you are dependent on your parents, the family members taken into account are your parent(s) and their other dependent children
ga: Má tá tú spleách ar do thuismitheoirí, is iad na daoine muinteartha a chuirtear san áireamh do thuismitheoir(í) agus a leanaí cleithiúnaigh eile

source: Special rate of grant for disadvantaged students
ga: Ráta speisialta deontais le haghaidh mic léinn faoi mhíbhuntáiste

source: Disadvantaged postgraduate students who meet a number of conditions can get tuition fees paid and essential field trips (up to €6,270)
ga: Féadfaidh mic léinn iarchéime faoi mhíbhuntáiste a shásaíonn roinnt coinníollacha íocaíocht a fháil as táillí teagaisc agus as turais riachtanacha allamuigh (a mhéid agus €6,270)

source: To qualify for the special rate of grant for disadvantaged students:
ga: Chun cáiliú don ráta speisialta deontais le haghaidh mic léinn faoi mhíbhuntáiste:

source: • You must have satisfied the conditions for the standard maintenance grant under the Student Grant Scheme for the academic year 2017-2018
ga: • Níor mhór gur shásaigh tú na coinníollacha le haghaidh an deontais chaighdeánaigh chothabhála faoin Scéim Deontais do Mhic Léinn do bhliain acadúil 2017-2018

source: Detailed information on the standard maintenance grant is available in our document on Grants for student in further and higher education
ga: Tá fáil ar fhaisnéis shonrach ar an deontas caighdeánach cothabhála inár gcáipéis ar Scéim um Dheontais do Mhic Léinn

source: • Your total reckonable income in the tax year January to December 2016 must not be more than €23,000, net of social welfare Qualified Child Increases and standard exclusions
ga: • Níor mhór go raibh d’ioncam iomlán inríofa i mbliain chánach 2016 (Eanáir-Nollaig) faoi bhun €23,000, glan ó leas sóisialach Méaduithe i leith Leanaí Cáilithe agus eisiaimh chaighdeánacha

source: • If you are an independent student, you must be getting certain social welfare payment or participating in a designated programme on 31 December 2016 – see below
ga: • Más mac léinn neamhspleách thú, ní mór go bhfuil íocaíocht áirithe leasa shóisialaigh á fáil agat mar gheall ar bheith rannpháirteach i gclár sainithe amhail an 31 Nollaig 2016 – féach thíos

source: If you are dependent on your parents, your parent(s)/guardian(s) must be getting certain social welfare payment or participating in a designated programme on 31 December 2016 – see below
ga: Má tá tú spleách ar do thuismitheoirí, ní mór go bhfuil íocaíocht áirithe leasa shóisialaigh á fáil ag do thuismitheoir(í)/chaomhnóir(í) mar gheall ar bheith rannpháirteach i gclár sainithe amhail an 31 Nollaig 2016 – féach thíos

source: Qualifying social welfare payments and programmes:
ga: Íocaíochtaí agus cláir cháilitheacha leasa shóisialaigh:

source: • Long-term social welfare payments
ga: • Íocaíochtaí fadtéarma leasa shóisialaigh

source: • Family Income Supplement (FIS)
ga: • Forlíonadh Ioncam Teaghlaigh (FIS)

source: • Designated programmes (for example, a Community Employment Scheme)
ga: • Cláir shainithe (mar shampla, Scéim Fhostaíochta Pobail)

source: These payments and programmes are listed in Schedule 2 of the Student Grant Scheme 2017
ga: Liostaítear na híocaíochtaí agus na cláir seo i Sceideal 2 de Scéim Deontais do Mhic Léinn 2017

source: Tax relief is available on postgraduate tuition fees
ga: Tá fáil ar Fhaoiseamh cánach ar tháillí teagaisc iarchéime

source: You should contact your college or university to find out about scholarships or bursaries
ga: Ba cheart duit teagmháil a dhéanamh le do choláiste nó d'ollscoil chun faisnéis a fháil faoi scoláireachtaí nó faoi sparánachtaí

source: There is also some information on studentfinance.ie
ga: Ina theannta sin, is ann do roinnt faisnéise ar studentfinance.ie

source: Financial institutions are providing loans to students to pay for postgraduate courses
ga: Tá iasachtaí á soláthar ag institiúidí airgeadais do mhic léinn chun íoc as cúrsaí iarchéime

source: Shop around for the best rates
ga: Cuardaigh thart chun teacht ar na rátaí is fearr

source: New postgraduate student grant applications
ga: Iarratais nua ar dheontas mic léinn iarchéime

source: Student Universal Support Ireland (SUSI) is the new single grant-awarding authority
ga: Is iad an t-údarás nua aonair bronnta deontais Tacaíocht Uilíoch do Mhic Léinn na hÉireann (SUSI)

source: It handles all new grant applications from 2012
ga: Láimhseálann sé gach iarratas nua ar dheontas ó 2012

source: Your grant/fee contribution will be awarded when you confirm acceptance of your place (usually late August/early September)
ga: Bronnfar do dheontas/ranníocaíocht táille ort nuair a dheimhníonn tú go nglacfaidh tú le d’áit ar chúrsa (de ghnáth go déanach i Lúnasa/go luath i Meán Fómhair)

source: SUSI will pay it into your designated Irish bank account. Renewal of student grant applications
ga: Íocfaidh SUSI an deontas isteach i do chuntas bainc Éireannach a ainmníonn tú
